{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_col": 5, "input_dtype": "float32", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_16", "nb_row": 5, "border_mode": "valid", "bias": true, "batch_input_shape": [null, 80, 220, 3], "b_regularizer": null, "nb_filter": 24, "W_constraint": null, "subsample": [2, 2]}}, {"class_name": "Activation", "config": {"name": "activation_31", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_17", "nb_row": 5, "border_mode": "valid", "bias": true, "subsample": [2, 2], "nb_filter": 36, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_32", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_18", "nb_row": 5, "border_mode": "valid", "bias": true, "subsample": [2, 2], "nb_filter": 48, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_33", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_19", "nb_row": 3, "border_mode": "valid", "bias": true, "subsample": [1, 1], "nb_filter": 64, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_34", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_20", "nb_row": 3, "border_mode": "valid", "bias": true, "subsample": [1, 1], "nb_filter": 64, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_35", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_36", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.25, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_37", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "name": "dense_13", "W_regularizer": null, "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "output_dim": 100, "bias": true, "input_dim": 3840, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_38", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "name": "dense_14", "W_regularizer": null, "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "output_dim": 50, "bias": true, "input_dim": 100, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_39", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "name": "dense_15", "W_regularizer": null, "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "output_dim": 10, "bias": true, "input_dim": 50, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_40", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "name": "dense_16", "W_regularizer": null, "activation": "linear", "b_constraint": null, "init": "normal", "output_dim": 1, "bias": true, "input_dim": 10, "W_constraint": null, "b_regularizer": null}}], "keras_version": "1.2.0"}