{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"nb_filter": 24, "nb_col": 5, "b_constraint": null, "input_dtype": "float32", "border_mode": "valid", "init": "glorot_uniform", "activation": "linear", "bias": true, "nb_row": 5, "trainable": true, "b_regularizer": null, "batch_input_shape": [null, 80, 220, 3], "name": "convolution2d_1", "dim_ordering": "tf", "subsample": [2, 2], "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "nb_col": 5, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "nb_row": 5, "trainable": true, "border_mode": "valid", "name": "convolution2d_2", "dim_ordering": "tf", "subsample": [2, 2], "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "nb_col": 5, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "nb_row": 5, "trainable": true, "border_mode": "valid", "name": "convolution2d_3", "dim_ordering": "tf", "subsample": [2, 2], "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "nb_col": 3, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "nb_row": 3, "trainable": true, "border_mode": "valid", "name": "convolution2d_4", "dim_ordering": "tf", "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "nb_col": 3, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "nb_row": 3, "trainable": true, "border_mode": "valid", "name": "convolution2d_5", "dim_ordering": "tf", "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.25, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "input_dtype": "float32", "init": "glorot_uniform", "activation": "linear", "bias": true, "output_dim": 100, "trainable": true, "b_regularizer": null, "batch_input_shape": [null, 3840], "name": "dense_1", "input_dim": 3840, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "input_dtype": "float32", "init": "glorot_uniform", "activation": "linear", "bias": true, "output_dim": 50, "trainable": true, "b_regularizer": null, "batch_input_shape": [null, 100], "name": "dense_2", "input_dim": 100, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "input_dtype": "float32", "init": "glorot_uniform", "activation": "linear", "bias": true, "output_dim": 10, "trainable": true, "b_regularizer": null, "batch_input_shape": [null, 50], "name": "dense_3", "input_dim": 50, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_10", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "input_dtype": "float32", "init": "normal", "activation": "linear", "bias": true, "output_dim": 1, "trainable": true, "b_regularizer": null, "batch_input_shape": [null, 10], "name": "dense_4", "input_dim": 10, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}}]}