{"keras_version": "1.2.0", "config": [{"config": {"nb_col": 5, "nb_filter": 24, "subsample": [2, 2], "W_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 80, 220, 3], "W_constraint": null, "b_regularizer": null, "activation": "linear", "b_constraint": null, "border_mode": "valid", "nb_row": 5, "bias": true, "init": "glorot_uniform", "input_dtype": "float32"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"nb_col": 5, "dim_ordering": "tf", "subsample": [2, 2], "W_regularizer": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "nb_filter": 36, "W_constraint": null, "b_regularizer": null, "activation": "linear", "b_constraint": null, "border_mode": "valid", "nb_row": 5, "bias": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"nb_col": 5, "dim_ordering": "tf", "subsample": [2, 2], "W_regularizer": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "nb_filter": 48, "W_constraint": null, "b_regularizer": null, "activation": "linear", "b_constraint": null, "border_mode": "valid", "nb_row": 5, "bias": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"nb_col": 3, "dim_ordering": "tf", "subsample": [1, 1], "W_regularizer": null, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "nb_filter": 64, "W_constraint": null, "b_regularizer": null, "activation": "linear", "b_constraint": null, "border_mode": "valid", "nb_row": 3, "bias": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"nb_col": 3, "dim_ordering": "tf", "subsample": [1, 1], "W_regularizer": null, "name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "nb_filter": 64, "W_constraint": null, "b_regularizer": null, "activation": "linear", "b_constraint": null, "border_mode": "valid", "nb_row": 3, "bias": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_5", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "name": "activation_6", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.25}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_7", "trainable": true}, "class_name": "Activation"}, {"config": {"input_dim": 3840, "W_regularizer": null, "name": "dense_1", "activity_regularizer": null, "bias": true, "W_constraint": null, "b_regularizer": null, "output_dim": 100, "activation": "linear", "b_constraint": null, "trainable": true, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_8", "trainable": true}, "class_name": "Activation"}, {"config": {"input_dim": 100, "W_regularizer": null, "name": "dense_2", "activity_regularizer": null, "bias": true, "W_constraint": null, "b_regularizer": null, "output_dim": 50, "activation": "linear", "b_constraint": null, "trainable": true, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_9", "trainable": true}, "class_name": "Activation"}, {"config": {"input_dim": 50, "W_regularizer": null, "name": "dense_3", "activity_regularizer": null, "bias": true, "W_constraint": null, "b_regularizer": null, "output_dim": 10, "activation": "linear", "b_constraint": null, "trainable": true, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_10", "trainable": true}, "class_name": "Activation"}, {"config": {"input_dim": 10, "W_regularizer": null, "name": "dense_4", "activity_regularizer": null, "bias": true, "W_constraint": null, "b_regularizer": null, "output_dim": 1, "activation": "linear", "b_constraint": null, "trainable": true, "init": "normal"}, "class_name": "Dense"}], "class_name": "Sequential"}