{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [2, 2], "W_regularizer": null, "activation": "linear", "b_regularizer": null, "input_dtype": "float32", "W_constraint": null, "dim_ordering": "tf", "nb_filter": 24, "init": "glorot_uniform", "trainable": true, "batch_input_shape": [null, 80, 160, 3], "border_mode": "valid", "name": "convolution2d_1", "nb_col": 5, "b_constraint": null, "bias": true, "nb_row": 5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [2, 2], "W_regularizer": null, "activation": "linear", "b_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "nb_filter": 36, "init": "glorot_uniform", "trainable": true, "border_mode": "valid", "name": "convolution2d_2", "nb_col": 5, "b_constraint": null, "bias": true, "nb_row": 5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [2, 2], "W_regularizer": null, "activation": "linear", "b_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "nb_filter": 48, "init": "glorot_uniform", "trainable": true, "border_mode": "valid", "name": "convolution2d_3", "nb_col": 5, "b_constraint": null, "bias": true, "nb_row": 5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "activation": "linear", "b_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "trainable": true, "border_mode": "valid", "name": "convolution2d_4", "nb_col": 3, "b_constraint": null, "bias": true, "nb_row": 3}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "activation": "linear", "b_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "trainable": true, "border_mode": "valid", "name": "convolution2d_5", "nb_col": 3, "b_constraint": null, "bias": true, "nb_row": 3}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Flatten", "config": {"input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 3, 13, 64], "name": "flatten_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.25}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "output_dim": 200, "W_constraint": null, "input_dim": 2496, "init": "glorot_uniform", "trainable": true, "name": "dense_1", "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "output_dim": 100, "W_constraint": null, "input_dim": 200, "init": "glorot_uniform", "trainable": true, "name": "dense_2", "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "output_dim": 10, "W_constraint": null, "input_dim": 100, "init": "glorot_uniform", "trainable": true, "name": "dense_3", "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "output_dim": 1, "W_constraint": null, "input_dim": 10, "init": "normal", "trainable": true, "name": "dense_4", "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_10", "activation": "tanh"}}]}